leeyanhuilyh/ESP32-CAM-Vehicle-with-QR-Scanner/src/main.cpp
#include "esp_camera.h"
#include "string.h"
#include "soc/soc.h"          
#include "soc/rtc_cntl_reg.h"


#include "qrcode_recognize.h"
#include "esp_log.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"

#include "esp32-hal-psram.h"
#include "Arduino.h"
#include <WiFi.h>
#include "quirc.h"
#include "quirc_internal.h"

#include "esp_http_server.h"
#include "esp_timer.h"
#include "img_converters.h"



#define CAMERA_MODEL_AI_THINKER
#define DEGUB_ESP

#ifdef DEGUB_ESP
  #define DBG(x) Serial.println(x)
#else 
  #define DBG(...)
#endif

#define PRINT_QR 1

static char *TAG = "QR-recognizer";

static const char *data_type_str(int dt)
{
    switch (dt) {
    case QUIRC_DATA_TYPE_NUMERIC:
        return "NUMERIC";
    case QUIRC_DATA_TYPE_ALPHA:
        return "ALPHA";
    case QUIRC_DATA_TYPE_BYTE:
        return "BYTE";
    case QUIRC_DATA_TYPE_KANJI:
        return "KANJI";
    }
    return "unknown";
}

using namespace std;

const char* ssid = "Challence";
const char* password = "0001923880";

camera_fb_t *fb = NULL;  
static camera_config_t camera_config;

bool qrMode = true;

// GPIO Setting
// Motor A = Right motor = OUT1 and OUT2
// Motor B = Left motor = OUT3 and OUT4

extern int Lb = 15; // Left Wheel Back 15
extern int Lf = 13; // Left Wheel Forward 13
extern int Rb = 14; // Right Wheel Back 14
extern int Rf = 2; // Right Wheel Forward 2
extern int LED =  4; // Light
extern String WiFiAddr = "";
char *payload_temp = "";

void startCameraServer();

// Set Static IP address
IPAddress local_IP(192, 168, 137, 20);
// Set Gateway IP address
IPAddress gateway(192, 168, 1, 1);
IPAddress subnet(255, 255, 0, 0);
IPAddress primaryDNS(8, 8, 8, 8); //optional
IPAddress secondaryDNS(8, 8, 4, 4); //optional

// QR Code functions

static void print_payload() {
    printf("manual print payload: %s\n", payload_temp);
}

static void dump_data(const struct quirc_data *data)
{   
    payload_temp = reinterpret_cast<char*>(const_cast<uint8_t*>(data->payload));
    
    printf("    Version: %d\n", data->version);
    printf("    ECC level: %c\n", "MLHQ"[data->ecc_level]);
    printf("    Mask: %d\n", data->mask);
    printf("    Data type: %d (%s)\n", data->data_type,
           data_type_str(data->data_type));
    printf("    Length: %d\n", data->payload_len);
    printf("\033[31m    Payload: %s\n", data->payload);

    if (data->eci) {
        printf("\033[31m    ECI: %d\n", data->eci);
    }
    printf("\033[0m\n");
    
   printf("Payload: %s\n", payload_temp);

}

static void dump_info(struct quirc *q, uint8_t count)
{
    for (int i = 0; i < count; i++) {
        struct quirc_code code;
        struct quirc_data data; //declaring a quirc_data struct as data

        // Extract the QR-code specified by the given index.
        quirc_extract(q, i, &code);
        quirc_decode_error_t err = quirc_decode(&code, &data);
        dump_data(&data);        
    }
}

void qr_recoginze(void *parameter)
{   
    ESP_LOGE(TAG, "qr rec heap: %u", xPortGetFreeHeapSize());
    camera_config_t *camera_config = (camera_config_t *)parameter;
    // Use QVGA Size currently, but quirc can support other frame size.(eg: 
    // FRAMESIZE_QVGA,FRAMESIZE_HQVGA,FRAMESIZE_QCIF,FRAMESIZE_QQVGA2,FRAMESIZE_QQVGA,etc)
    if (camera_config->frame_size > FRAMESIZE_SVGA) {
        ESP_LOGE(TAG, "Camera Frame Size err %d, support maxsize is QVGA", (camera_config->frame_size));
        vTaskDelete(NULL);
    }

    struct quirc *qr_recognizer = NULL;
    camera_fb_t *fb = NULL; //initialises frame buffer
    uint8_t *image = NULL;
    int id_count = 0;

    // Save image width and height, avoid allocate memory repeatly.
    uint16_t old_width = 0;
    uint16_t old_height = 0;

    // Construct a new QR-code recognizer.
    ESP_LOGI(TAG, "Construct a new QR-code recognizer(quirc).");
    qr_recognizer = quirc_new();
    if (!qr_recognizer) {
        ESP_LOGE(TAG, "Can't create quirc object");
       
    }

    ESP_LOGE(TAG, "alloc qr heap: %u", xPortGetFreeHeapSize());
    ESP_LOGE(TAG, "uxHighWaterMark = %d", uxTaskGetStackHighWaterMark( NULL ));

    while (1) {
        // Capture a frame
        fb = esp_camera_fb_get();
        if (!fb) {
            ESP_LOGE(TAG, "Camera capture failed");
            esp_err_t esp_camera_deinit();
            esp_err_t err = esp_camera_init(camera_config);
            continue;
        }
        if (old_width != fb->width || old_height != fb->height) {
            ESP_LOGE(TAG, "Recognizer size change w h len: %d, %d, %d", fb->width, fb->height, fb->len);
            ESP_LOGE(TAG, "Resize the QR-code recognizer.");
            // Resize the QR-code recognizer.
            if (quirc_resize(qr_recognizer, fb->width, fb->height) < 0) {
                
                ESP_LOGE(TAG, "Resize the QR-code recognizer err (cannot allocate memory).");
                
                continue;
            } else {
                old_width = fb->width;
                old_height = fb->height;
            }
        }

        /** These functions are used to process images for QR-code recognition.
         * quirc_begin() must first be called to obtain access to a buffer into
         * which the input image should be placed. Optionally, the current
         * width and height may be returned.
         *
         * After filling the buffer, quirc_end() should be called to process
         * the image for QR-code recognition. The locations and content of each
         * code may be obtained using accessor functions described below.
         */

        image = quirc_begin(qr_recognizer, NULL, NULL); //quirc_begin obtains access to buffer
        memcpy(image, fb->buf, fb->len);    //assigns image to address of buf
        quirc_end(qr_recognizer);   //processes image for qr recognition

        // Return the number of QR-codes identified in the last processed image.
        id_count = quirc_count(qr_recognizer);
        if (id_count == 0) {
            esp_camera_fb_return(fb);
            continue;
        }
        

        // Print information of QR-code
        dump_info(qr_recognizer, id_count);
        print_payload();
        esp_camera_fb_return(fb);
    }
    // Destroy QR-Code recognizer (quirc)
    quirc_destroy(qr_recognizer);
    ESP_LOGE(TAG, "Deconstruct QR-Code recognizer(quirc)");
    vTaskDelete(NULL);
}

void app_qr_recognize(void *pdata)
{
    xTaskCreate(qr_recoginze, "qr_recoginze", 1024 * 100, pdata, 5, NULL);
}
//---------------------------------------------------
void setup()
{
  #ifdef DEGUB_ESP
    Serial.begin(115200);
    Serial.setDebugOutput(true);
  #endif
  esp_log_level_set("*", ESP_LOG_VERBOSE);
  ESP_LOGE(TAG, "Free heap: %u", xPortGetFreeHeapSize());

  pinMode(Lb, OUTPUT); //Left Backward
  pinMode(Lf, OUTPUT); //Left Forward
  pinMode(Rb, OUTPUT); //Right Backwawrd
  pinMode(Rf, OUTPUT); //Right Forward
  pinMode(LED, OUTPUT); //Light

  //initialize
  digitalWrite(Lb, LOW);
  digitalWrite(Lf, LOW);
  digitalWrite(Rb, LOW);
  digitalWrite(Rf, LOW);
  digitalWrite(LED, LOW);


  //use lq camera settings if the module credentials are not set yet.

